AlmAck/svdtonuttx/demo/h/da1470_lcdc.h
#define LCDC_LCDC_PALETTE_255_PALLETE_B_POS              (0) /* Gamma ramp blue bits */
#define LCDC_LCDC_PALETTE_BASE_PALLETE_R_MASK            (0xFF << 16) /* Gamma ramp red bits */
#define LCDC_LCDC_PALETTE_BASE_PALLETE_R_POS             (16) /* Gamma ramp red bits */
#define LCDC_LCDC_PALETTE_BASE_PALLETE_G_MASK            (0xFF << 8) /* Gamma ramp green bits */
#define LCDC_LCDC_PALETTE_BASE_PALLETE_G_POS             (8) /* Gamma ramp green bits */
#define LCDC_LCDC_PALETTE_BASE_PALLETE_B_MASK            (0xFF << 0) /* Gamma ramp blue bits */
#define LCDC_LCDC_PALETTE_BASE_PALLETE_B_POS             (0) /* Gamma ramp blue bits */
#define LCDC_LCDC_RESXY_RES_X_MASK                       (0xFFFF << 16) /* Resolution X in pixels. */
#define LCDC_LCDC_RESXY_RES_X_POS                        (16) /* Resolution X in pixels. */
#define LCDC_LCDC_RESXY_RES_Y_MASK                       (0xFFFF << 0) /* Resolution Y in pixels. */
#define LCDC_LCDC_RESXY_RES_Y_POS                        (0) /* Resolution Y in pixels. */
#define LCDC_LCDC_STARTXY_START_X_MASK                   (0xFFFF << 16) /* Specify framess X dimension */
#define LCDC_LCDC_STARTXY_START_X_POS                    (16) /* Specify framess X dimension */
#define LCDC_LCDC_STARTXY_START_Y_MASK                   (0xFFFF << 0) /* Specify framess Y dimension */
#define LCDC_LCDC_STARTXY_START_Y_POS                    (0) /* Specify framess Y dimension */
#define LCDC_LCDC_STATUS_DBIB_CMD_FIFO_FULL              (1U << 15) /* Indicates if the command FIFO is full */
#define LCDC_LCDC_STATUS_DBI_SPI_CS                      (1U << 14) /* Indicates DBI/SPI CS status */
#define LCDC_LCDC_STATUS_FRAME_END                       (1U << 13) /* Frame end (active high) */
#define LCDC_LCDC_STATUS_DBIB_OUT_TRANS_PENDING          (1U << 12) /* Pending output transaction in DBI Type-B interface */
#define LCDC_LCDC_STATUS_DBIB_CMD_PENDING                (1U << 11) /* Transferring of command in progress. 0: idle 1: in progress */
#define LCDC_LCDC_STATUS_DBIB_DATA_PENDING               (1U << 10) /* Pending RGB data in DBI Type-B interface */
#define LCDC_LCDC_STATUS_DBIB_TE                         (1U << 8) /* The DBIB tearing effect signal */
#define LCDC_LCDC_STATUS_STICKY_UNDERFLOW                (1U << 7) /* Sticky underflow(clear with write in the LCDC_INTERRUPT_REG) 0: There is no unde */
#define LCDC_LCDC_STATUS_UNDERFLOW                       (1U << 6) /* Underflow on the current transfer. 0: There is no underflow 1: Underflow has bee */
#define LCDC_LCDC_STATUS_LAST_ROW                        (1U << 5) /* Last row (Last row is currently displayed) */
#define LCDC_LCDC_STATUS_STAT_CSYNC                      (1U << 4) /* CSYNC signal level */
#define LCDC_LCDC_STATUS_STAT_VSYNC                      (1U << 3) /* VSYNC signal level */
#define LCDC_LCDC_STATUS_STAT_HSYNC                      (1U << 2) /* HSYNC signal level */
#define LCDC_LCDC_STATUS_FRAMEGEN_BUSY                   (1U << 1) /* The frame generator is busy (active high). */
#define LCDC_LCDC_STATUS_STAT_ACTIVE                     (1U << 0) /* Active (When not in vertical blanking) */

#endif /* __DA1470_LCDC_H */
